app/views/garbages/_form.html.erb

    <%= f.label :thrower %><br />
    <%= f.collection_select(:thrower_id, Thrower.all, :id, :name) %>
---
SELECT "throwers".* FROM "throwers"

    <%= f.label :garbage_can %><br />
    <%= f.collection_select(:garbage_can_id, GarbageCan.all, :id, :name) %>
---
SELECT "garbage_cans".* FROM "garbage_cans"