app/controllers/garbage_cans_controller.rb

SELECT "garbage_cans".* FROM "garbage_cans"
---
  def index
    @garbage_cans = GarbageCan.all

SELECT "garbage_cans".* FROM "garbage_cans" WHERE "garbage_cans"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @garbage_can = GarbageCan.find(params[:id])

INSERT INTO "garbage_cans" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 26 Apr 2013 03:44:46 UTC +00:00], ["name", "Kitchen"], ["updated_at", Fri, 26 Apr 2013 03:44:46 UTC +00:00]]
---
  def create
    @garbage_can = GarbageCan.new(params[:garbage_can])

    respond_to do |format|
      if @garbage_can.save

SELECT "garbage_cans".* FROM "garbage_cans" WHERE "garbage_cans"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "garbage_cans" WHERE "garbage_cans"."id" = ?  [["id", 4]]
---
  def destroy
    @garbage_can = GarbageCan.find(params[:id])
    @garbage_can.destroy