app/controllers/garbages_controller.rb

SELECT "garbages".* FROM "garbages"
---
  def index
    @garbages = Garbage.all

SELECT "garbages".* FROM "garbages" WHERE "garbages"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @garbage = Garbage.find(params[:id])

SELECT "garbages".* FROM "garbages" WHERE "garbages"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @garbage = Garbage.find(params[:id])

INSERT INTO "garbages" ("created_at", "garbage_can_id", "item", "thrower_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 26 Apr 2013 03:53:23 UTC +00:00], ["garbage_can_id", 1], ["item", "Pop can"], ["thrower_id", 1], ["updated_at", Fri, 26 Apr 2013 03:53:23 UTC +00:00]]
---
  def create
    @garbage = Garbage.new(params[:garbage])

    respond_to do |format|
      if @garbage.save

SELECT "garbages".* FROM "garbages" WHERE "garbages"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "garbages" SET "item" = 'Soda Can', "updated_at" = '2013-04-26 17:10:53.697894' WHERE "garbages"."id" = 2
---
  def update
    @garbage = Garbage.find(params[:id])

    respond_to do |format|
      if @garbage.update_attributes(params[:garbage])

SELECT "garbages".* FROM "garbages" WHERE "garbages"."id" = ? LIMIT 1  [["id", "31"]]
DELETE FROM "garbages" WHERE "garbages"."id" = ?  [["id", 31]]
---
  def destroy
    @garbage = Garbage.find(params[:id])
    @garbage.destroy